Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/СтроковыеСведенияФизическихЛиц/СтроковыеСведенияФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтроковыеСведенияФизическихЛиц</name>
  <resources>
    <name>Документы</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗнаниеЯзыков</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Награды</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Образование</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПовышениеКвалификации</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Переподготовка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Профессии</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СоставСемьи</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Специальности</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТрудоваяДеятельность</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/ЗнаниеЯзыковФизическихЛиц/ЗнаниеЯзыковФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗнаниеЯзыковФизическихЛиц</name>
  <resources>
    <name>СтепеньЗнанияЯзыка</name>
    <type>
      <types>CatalogRef.СтепениЗнанияЯзыка</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Язык</name>
    <type>
      <types>CatalogRef.ЯзыкиНародовМира</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/НаградыФизическихЛиц/НаградыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НаградыФизическихЛиц</name>
  <resources>
    <name>Награда</name>
    <type>
      <types>CatalogRef.Награды</types>
    </type>
  </resources>
  <resources>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеПриказа</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/ПрофессииФизическихЛиц/ПрофессииФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрофессииФизическихЛиц</name>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Профессия</name>
    <type>
      <types>CatalogRef.ПрофессииРабочих</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/СпециальностиФизическихЛиц/СпециальностиФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпециальностиФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>РазрядКатегория</name>
    <type>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/ТрудоваяДеятельностьФизическихЛиц/ТрудоваяДеятельностьФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТрудоваяДеятельностьФизическихЛиц</name>
  <resources>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СфераДеятельностиКомпании</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресОрганизации</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/ВидыПрофессиональнойПодготовки/ВидыПрофессиональнойПодготовки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПрофессиональнойПодготовки</name>
  <enumValues>
    <name>Переподготовка</name>
  </enumValues>
  <enumValues>
    <name>ПовышениеКвалификации</name>
  </enumValues>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/ОбразованиеФизическихЛиц/ОбразованиеФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбразованиеФизическихЛиц</name>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>ВидОбразования</name>
    <type>
      <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПослевузовскогоОбразования</name>
    <type>
      <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебноеЗаведение</name>
    <type>
      <types>CatalogRef.УчебныеЗаведения</types>
    </type>
  </attributes>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовОбОбразовании</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Квалификация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДополнительногоОбучения</name>
    <type>
      <types>EnumRef.ВидыПрофессиональнойПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДокументОснование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/РодственникиФизическихЛиц/РодственникиФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РодственникиФизическихЛиц</name>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>СтепеньРодства</name>
    <type>
      <types>CatalogRef.СтепениРодстваФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаИждивении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьВТ2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/СтроковыеСведенияФизическихЛиц/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьСтроковыеСведенияФизическогоЛица(ФизическоеЛицо, ПричинаОбновления = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	СтроковыеСведения = СтроковыеСведенияФизическогоЛица(ФизическоеЛицо);	
	
	ОбновлятьВсеСведения = ПричинаОбновления = Неопределено;
	
	Если ПричинаОбновления = "Документы"
		Или ОбновлятьВсеСведения Тогда
		ОбновитьДокументы(СтроковыеСведения);
	КонецЕсли;
	
	Если ПричинаОбновления = "ЗнаниеЯзыков" 
		Или ОбновлятьВсеСведения Тогда
		ОбновитьЗнаниеЯзыков(СтроковыеСведения);
	КонецЕсли;
	
	Если ПричинаОбновления = "Награды"
		Или ОбновлятьВсеСведения Тогда
		ОбновитьНаграды(СтроковыеСведения);
	КонецЕсли;
	
	Если ПричинаОбновления = "Образование"
		Или ОбновлятьВсеСведения  Тогда
		ОбновитьОбучение(СтроковыеСведения);
	КонецЕсли;
	
	Если ПричинаОбновления = "Профессии" 
		Или ОбновлятьВсеСведения Тогда
		ОбновитьПрофессии(СтроковыеСведения);
	КонецЕсли;
	
	Если ПричинаОбновления = "СоставСемьи"
		Или ОбновлятьВсеСведения Тогда
		ОбновитьСоставСемьи(СтроковыеСведения);
	КонецЕсли;
	
	Если ПричинаОбновления = "Специальности"
		Или ОбновлятьВсеСведения Тогда
		ОбновитьСпециальности(СтроковыеСведения);
	КонецЕсли;
	
	Если ПричинаОбновления = "ТрудоваяДеятельность"
		Или ОбновлятьВсеСведения Тогда
		ОбновитьТрудовуюДеятельность(СтроковыеСведения);
	КонецЕсли;
	
	ЗаписатьСтроковыеСведенияФизическогоЛица(СтроковыеСведения);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтроковыеСведенияФизическогоЛица(ФизическоеЛицо)
	
	СтроковыеСведения = СоздатьМенеджерЗаписи();
	СтроковыеСведения.ФизическоеЛицо = ФизическоеЛицо;
	СтроковыеСведения.Прочитать();
	Если НЕ СтроковыеСведения.Выбран() Тогда
		СтроковыеСведения.ФизическоеЛицо = ФизическоеЛицо;
	КонецЕсли;
	
	Возврат СтроковыеСведения;
	
КонецФункции 

Процедура ЗаписатьСтроковыеСведенияФизическогоЛица(СтроковыеСведения)
	
	СтроковыеСведения.Записать();
	
КонецПроцедуры

Функция ОбновитьДокументы(СтроковыеСведения)
	СтроковыеСведения.Документы = СтрокаДокументы(СтроковыеСведения.ФизическоеЛицо);
КонецФункции

Функция ОбновитьЗнаниеЯзыков(СтроковыеСведения)
	СтроковыеСведения.ЗнаниеЯзыков = СтрокаЗнаниеЯзыков(СтроковыеСведения.ФизическоеЛицо);
КонецФункции

Функция ОбновитьНаграды(СтроковыеСведения)
	СтроковыеСведения.Награды = СтрокаНаграды(СтроковыеСведения.ФизическоеЛицо);
КонецФункции

Функция ОбновитьОбучение(СтроковыеСведения)
	
	ДанныеОбОбучении = ДанныеОбОбучении(СтроковыеСведения.ФизическоеЛицо);
	
	Если ДанныеОбОбученииЗаполнены(ДанныеОбОбучении) Тогда
		СтроковыеСведения.Образование 			= СтрокаОбразование(ДанныеОбОбучении);
		СтроковыеСведения.ПовышениеКвалификации = СтрокаПовышениеКвалификации(ДанныеОбОбучении);
		СтроковыеСведения.Переподготовка 		= СтрокаПереподготовка(ДанныеОбОбучении);
	КонецЕсли;
	
КонецФункции

Функция ОбновитьПрофессии(СтроковыеСведения)
	СтроковыеСведения.Профессии = СтрокаПрофессии(СтроковыеСведения.ФизическоеЛицо);
КонецФункции

Функция ОбновитьСоставСемьи(СтроковыеСведения)
	СтроковыеСведения.СоставСемьи = СтрокаСоставСемьи(СтроковыеСведения.ФизическоеЛицо);
КонецФункции

Функция ОбновитьСпециальности(СтроковыеСведения)
	СтроковыеСведения.Специальности = СтрокаСпециальности(СтроковыеСведения.ФизическоеЛицо);
КонецФункции

Функция ОбновитьТрудовуюДеятельность(СтроковыеСведения)
	СтроковыеСведения.ТрудоваяДеятельность = СтрокаТрудоваяДеятельность(СтроковыеСведения.ФизическоеЛицо);
КонецФункции

#Область Документы

Функция СтрокаДокументы(ФизическоеЛицо)
	СтрокаДокументы = "";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ФизическоеЛицо КАК ФизЛицо,
	|	&Период КАК Период
	|ПОМЕСТИТЬ ВТФизическиеЛицаПериоды";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("Период", '00010101');
	Запрос.Выполнить();
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.ФормироватьСПериодичностьДень = Ложь;
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТФизическиеЛицаПериоды", "ФизЛицо");
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних("ДокументыФизическихЛиц", Запрос.МенеджерВременныхТаблиц, Истина, ОписаниеФильтра, ПараметрыПостроения);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыФизическихЛиц.Представление
	|ИЗ
	|	ВТДокументыФизическихЛицСрезПоследних КАК ДокументыФизическихЛиц";
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаДокументы = СтрокаДокументы + Выборка.Представление + Символы.ПС;
		КонецЦикла;	
	КонецЕсли;
	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаДокументы);
	
	Возврат СтрокаДокументы;
КонецФункции 

#КонецОбласти 

#Область ЗнаниеЯзыков

Функция СтрокаЗнаниеЯзыков(ФизическоеЛицо)
	СтрокаЗнаниеЯзыков = РегистрыСведений.ЗнаниеЯзыковФизическихЛиц.ПредставлениеВладениеЯзыкамиФизическогоЛица(ФизическоеЛицо);	
	Возврат СтрокаЗнаниеЯзыков;
КонецФункции 

#КонецОбласти 

#Область Награды

Функция СтрокаНаграды(ФизическоеЛицо)
	СтрокаНаграды = "";
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаградыФизическихЛиц.Награда,
	|	НаградыФизическихЛиц.НомерПриказа,
	|	НаградыФизическихЛиц.ДатаПриказа,
	|	НаградыФизическихЛиц.НаименованиеПриказа
	|ИЗ
	|	РегистрСведений.НаградыФизическихЛиц КАК НаградыФизическихЛиц
	|ГДЕ
	|	НаградыФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаградыФизическихЛиц.НомерПоПорядку";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаНаграды = СтрокаНаграды + ПредставлениеНаграды(Выборка) + Символы.ПС;
		КонецЦикла;	
	КонецЕсли;
	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаНаграды);
	
	Возврат СтрокаНаграды;
КонецФункции 

Функция ПредставлениеНаграды(Награда)
	ПредставлениеНаграды = НСтр("ru = '%1, %2 №%3 от %4'");
	ПредставлениеНаграды = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПредставлениеНаграды, Награда.Награда, Награда.НаименованиеПриказа, Награда.НомерПриказа, Формат(Награда.ДатаПриказа, "ДЛФ=DD"));
	Возврат ПредставлениеНаграды;
КонецФункции

#КонецОбласти 

#Область Обучение

Функция ДанныеОбОбучении(ФизическоеЛицо)
	
	ДанныеОбОбразовании = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбразованиеФизическихЛиц.ВидОбразования КАК ВидОбразования,
	|	ОбразованиеФизическихЛиц.ВидПослевузовскогоОбразования КАК ВидПослевузовскогоОбразования,
	|	ОбразованиеФизическихЛиц.УчебноеЗаведение КАК УчебноеЗаведение,
	|	ОбразованиеФизическихЛиц.Специальность КАК Специальность,
	|	ОбразованиеФизическихЛиц.ВидДокумента КАК ВидДокумента,
	|	ОбразованиеФизическихЛиц.Серия КАК Серия,
	|	ОбразованиеФизическихЛиц.Номер КАК Номер,
	|	ОбразованиеФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	|	ОбразованиеФизическихЛиц.Квалификация КАК Квалификация,
	|	ОбразованиеФизическихЛиц.Начало КАК Начало,
	|	ОбразованиеФизическихЛиц.Окончание КАК Окончание,
	|	ОбразованиеФизическихЛиц.НаименованиеКурса КАК НаименованиеКурса,
	|	ОбразованиеФизическихЛиц.КоличествоЧасов КАК КоличествоЧасов,
	|	ОбразованиеФизическихЛиц.ВидДополнительногоОбучения КАК ВидДополнительногоОбучения
	|ИЗ
	|	Справочник.ОбразованиеФизическихЛиц КАК ОбразованиеФизическихЛиц
	|ГДЕ
	|	ОбразованиеФизическихЛиц.Владелец = &ФизическоеЛицо
	|	И НЕ ОбразованиеФизическихЛиц.ПометкаУдаления";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ДанныеОбОбразовании = Результат.Выбрать();
	КонецЕсли;
	
	Возврат ДанныеОбОбразовании;
	
КонецФункции	

Функция ДанныеОбОбученииЗаполнены(ДанныеОбОбразовании)
	
	Возврат ДанныеОбОбразовании <> Неопределено;	
	
КонецФункции

Функция ПредставлениеПериодаОбучения(Результат, УчебноеЗаведение, ДатаНачала, ДатаОкончания)

	ПредставлениеПериодаОбучения = "";
	
	ПараметрыПодстановки = Новый Массив;
	ПараметрыПодстановки.Добавить(Результат);
	ПараметрыПодстановки.Добавить(УчебноеЗаведение);
	ПараметрыПодстановки.Добавить(Формат(ДатаНачала, "ДЛФ=D"));
	ПараметрыПодстановки.Добавить(Формат(ДатаОкончания, "ДЛФ=D"));
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ПредставлениеПериодаОбучения = ПредставлениеПериодаОбучения + "%1";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УчебноеЗаведение) Тогда
		Если НЕ ПустаяСтрока(ПредставлениеПериодаОбучения) Тогда
			ПредставлениеПериодаОбучения = ПредставлениеПериодаОбучения + ", ";
		КонецЕсли;
		ПредставлениеПериодаОбучения = ПредставлениеПериодаОбучения + "%2";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачала)
		И ЗначениеЗаполнено(ДатаОкончания) Тогда
		ПредставлениеПериодаОбучения = ПредставлениеПериодаОбучения + " (%3 - %4)";
	ИначеЕсли ЗначениеЗаполнено(ДатаНачала) Тогда
		ПредставлениеПериодаОбучения = ПредставлениеПериодаОбучения + НСтр("ru = ' (с %3)'");
	ИначеЕсли ЗначениеЗаполнено(ДатаОкончания) Тогда
		ПредставлениеПериодаОбучения = ПредставлениеПериодаОбучения + НСтр("ru = ' (по %4)'");
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПредставлениеПериодаОбучения) Тогда
		ПредставлениеПериодаОбучения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтрокуИзМассива(ПредставлениеПериодаОбучения, ПараметрыПодстановки); 
	КонецЕсли;
	
	Возврат ПредставлениеПериодаОбучения;
	
КонецФункции

#Область Образование

Функция СтрокаОбразование(ДанныеОбОбучении)
	
	СтрокаОбразование = "";
	
	ДанныеОбОбучении.Сбросить();
	
	Пока ДанныеОбОбучении.Следующий() Цикл
		Если ЭтоДанныеОбОбразовании(ДанныеОбОбучении) Тогда
			СтрокаОбразование = СтрокаОбразование + ПредставлениеОбразования(ДанныеОбОбучении) + Символы.ПС;
		КонецЕсли;
	КонецЦикла;	
	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаОбразование);
	
	Возврат СтрокаОбразование;
	
КонецФункции

Функция ПредставлениеОбразования(Образование)
	Возврат ПредставлениеПериодаОбучения(Образование.Специальность, Образование.УчебноеЗаведение, Образование.Начало, Образование.Окончание);
КонецФункции	

Функция ЭтоДанныеОбОбразовании(ДанныеОбОбучении)
	Возврат ДанныеОбОбучении.ВидДополнительногоОбучения = Перечисления.ВидыПрофессиональнойПодготовки.ПустаяСсылка()
		Или ДанныеОбОбучении.ВидДополнительногоОбучения = Перечисления.ВидыПрофессиональнойПодготовки.Подготовка;
КонецФункции 

#КонецОбласти

#Область ПовышениеКвалификации

Функция СтрокаПовышениеКвалификации(ДанныеОбОбучении)
	
	СтрокаПовышениеКвалификации = "";
	
	ДанныеОбОбучении.Сбросить();
	
	Пока ДанныеОбОбучении.Следующий() Цикл
		Если ЭтоДанныеОПовышенииКвалификации(ДанныеОбОбучении) Тогда
			СтрокаПовышениеКвалификации = СтрокаПовышениеКвалификации + ПредставлениеПовышенияКвалификации(ДанныеОбОбучении) + Символы.ПС;
		КонецЕсли;
	КонецЦикла;	
	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаПовышениеКвалификации);
	
	Возврат СтрокаПовышениеКвалификации;
	
КонецФункции

Функция ПредставлениеПовышенияКвалификации(ПовышениеКвалификации)
	Возврат ПредставлениеПериодаОбучения(ПовышениеКвалификации.Квалификация, ПовышениеКвалификации.УчебноеЗаведение, ПовышениеКвалификации.Начало, ПовышениеКвалификации.Окончание);
КонецФункции

Функция ЭтоДанныеОПовышенииКвалификации(ДанныеОбОбучении)
	Возврат ДанныеОбОбучении.ВидДополнительногоОбучения = Перечисления.ВидыПрофессиональнойПодготовки.ПовышениеКвалификации;
КонецФункции 

#КонецОбласти 

#Область Переподготовка

Функция СтрокаПереподготовка(ДанныеОбОбучении)
	
	СтрокаПереподготовка = "";
	
	ДанныеОбОбучении.Сбросить();
	
	Пока ДанныеОбОбучении.Следующий() Цикл
		Если ЭтоДанныеОПереподготовке(ДанныеОбОбучении) Тогда
			СтрокаПереподготовка = СтрокаПереподготовка + ПредставлениеПереподготовки(ДанныеОбОбучении) + Символы.ПС;
		КонецЕсли;
	КонецЦикла;	
	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаПереподготовка);
	
	Возврат СтрокаПереподготовка;
	
КонецФункции

Функция ЭтоДанныеОПереподготовке(ДанныеОбОбучении)
	Возврат ДанныеОбОбучении.ВидДополнительногоОбучения = Перечисления.ВидыПрофессиональнойПодготовки.Переподготовка;
КонецФункции 

Функция ПредставлениеПереподготовки(Переподготовка)
	Возврат ПредставлениеПериодаОбучения(Переподготовка.Специальность, Переподготовка.УчебноеЗаведение, Переподготовка.Начало, Переподготовка.Окончание);
КонецФункции

#КонецОбласти 

#КонецОбласти 

#Область Профессии

Функция СтрокаПрофессии(ФизическоеЛицо)
	СтрокаПрофессии = РегистрыСведений.ПрофессииФизическихЛиц.ПредставлениеПрофессийФизическогоЛица(ФизическоеЛицо);	
	Возврат СтрокаПрофессии;
КонецФункции 

#КонецОбласти 

#Область СоставСемьи

Функция СтрокаСоставСемьи(ФизическоеЛицо)
	СтрокаСоставСемьи = "";
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РодственникиФизическихЛиц.СтепеньРодства КАК СтепеньРодства,
	|	РодственникиФизическихЛиц.Наименование КАК ФИО,
	|	РодственникиФизическихЛиц.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	Справочник.РодственникиФизическихЛиц КАК РодственникиФизическихЛиц
	|ГДЕ
	|	РодственникиФизическихЛиц.Владелец = &ФизическоеЛицо
	|	И НЕ РодственникиФизическихЛиц.СкрыватьВТ2
	|	И НЕ РодственникиФизическихЛиц.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	РодственникиФизическихЛиц.ДатаРождения УБЫВ";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаСоставСемьи = СтрокаСоставСемьи + ПредставлениеЧленаСемьи(Выборка) + Символы.ПС;
		КонецЦикла;	
	КонецЕсли;
	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаСоставСемьи);
	
	Возврат СтрокаСоставСемьи;
КонецФункции

Функция ПредставлениеЧленаСемьи(ЧленСемьи)
	
	Если ЗначениеЗаполнено(ЧленСемьи.СтепеньРодства) Тогда
		
		ПредставлениеЧленаСемьи = "%1: %2";
		ПредставлениеЧленаСемьи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ПредставлениеЧленаСемьи, ЧленСемьи.СтепеньРодства, ЧленСемьи.ФИО);
		
	Иначе
		
		ПредставлениеЧленаСемьи = "%1";
		ПредставлениеЧленаСемьи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ПредставлениеЧленаСемьи, ЧленСемьи.ФИО);
		
	КонецЕсли;
	
	Возврат ПредставлениеЧленаСемьи;
	
КонецФункции

#КонецОбласти 

#Область Специальности

Функция СтрокаСпециальности(ФизическоеЛицо)
	СтрокаСпециальности = РегистрыСведений.СпециальностиФизическихЛиц.ПредставлениеСпециальностейФизическогоЛица(ФизическоеЛицо);
	Возврат СтрокаСпециальности;
КонецФункции 

#КонецОбласти 

#Область ТрудоваяДеятельность

Функция СтрокаТрудоваяДеятельность(ФизическоеЛицо)
	СтрокаТрудоваяДеятельность = "";
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТрудоваяДеятельностьФизическихЛиц.Организация,
	|	ТрудоваяДеятельностьФизическихЛиц.ДатаНачала,
	|	ТрудоваяДеятельностьФизическихЛиц.ДатаОкончания,
	|	ТрудоваяДеятельностьФизическихЛиц.Должность
	|ИЗ
	|	РегистрСведений.ТрудоваяДеятельностьФизическихЛиц КАК ТрудоваяДеятельностьФизическихЛиц
	|ГДЕ
	|	ТрудоваяДеятельностьФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТрудоваяДеятельностьФизическихЛиц.НомерПоПорядку";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТрудоваяДеятельность = СтрокаТрудоваяДеятельность + ПредставлениеМестаРаботы(Выборка) + Символы.ПС;
		КонецЦикла;	
	КонецЕсли;
	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаТрудоваяДеятельность);
	
	Возврат СтрокаТрудоваяДеятельность;
КонецФункции 

Функция ПредставлениеМестаРаботы(МестоРаботы)
	ПредставлениеМестаРаботы = "%1, %2, с %3 по %4";
	ПредставлениеМестаРаботы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПредставлениеМестаРаботы, МестоРаботы.Организация, МестоРаботы.Должность, Формат(МестоРаботы.ДатаНачала, "ДЛФ=D"), Формат(МестоРаботы.ДатаОкончания, "ДЛФ=D"));
	Возврат ПредставлениеМестаРаботы;
КонецФункции

#КонецОбласти 

#КонецОбласти

#КонецЕсли
